Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/witnesses/how_you_are_called_as_a_witness.html.txt.tmx
Source language: en
Languages: ga

source: How you are called as a witness
ga: An chaoi a nglaotar ar dhuine le bheith ina f(h)inné

source: You may be called as a witness in a criminal case or a civil case
ga: D'fhéadfá a bheith glaoite mar fhinné i gcás coiriúil nó i gcás sibhialta

source: The general rule is that everyone is competent and can be compelled to be a witness
ga: Mar riail ghinearálta tá gach duine inniúil agus is féidir iallach a chur ar dhuine a bheith ina f(h)inné

source: Before the trial of the case, you may be contacted by legal representatives for the party who wishes to call you as a witness
ga: Roimh an triail don chás, d'fhéadfadh sé go ndéanfadh ionadaithe dlíthiúla an té gur mian leis/léi glaoch ort mar fhinné teagmháil leat

source: They may wish to obtain a written statement from you about what happened and/or they may wish to meet with you to discuss it
ga: Dfhéadfadh sé go mbeadh siad ag iarraidh ráiteas i scríbhinn a fháil uait maidir lenar tharla agus/nó d'fhéadfadh sé go mbeadh siad ag iarraidh castáil leat leis an scéal a phlé

source: If a party in a court case wishes to call you as a witness, you will receive a "witness summons" or a "subpoena"
ga: Más mian le páirtí i gcás cúirte glaoch ort mar fhinné, gheobhaidh tú toghairm fhinné nó subpoena

source: This is a simple court form that sets out:
ga: Is foirm shimplí chúirte í seo ina bhfuil na rudaí seo a leanas leagtha síos:

source: • The date and time that the case will be heard
ga: • An dáta agus an t-am a mbeidh an cás dhá chloisteáil

source: • The place (the court) where you must attend
ga: • An áit (an chúirt) ina mbeidh ort freastal a dhéanamh

source: If you have received a summons or subpoena, you must attend on the date in question at the court
ga: Má tá toghairm nó subpoena faighte agat, ní mór duit a bheith i láthair sa chúirt ar an dáta atá i gceist

source: If you fail to do so, you can be imprisoned for "contempt of court"
ga: Má theipeann ort a bheith ann is féidir téarma príosúnachta a ghearradh ort as díspeagadh cúirte

source: It is not a good defence for you to say that you are intimidated by one of the parties in the case or afraid to give evidence
ga: Níl sé sách maith duit a rá go raibh tú scanraithe roimh duine de na páirtithe a bhaineann leis an gcás le theacht i láthair nó go raibh eagla ort fianaise a thabhairt

source: If you have to take time off work in order to attend court, you are not entitled to be paid while away from work
ga: Má tá tú ag am a thógáil saor ón obair chun freastal ar an gcúirt, nach bhfuil tú i dteideal a bheidh le híoc fad ar shiúl ón obair

source: You may be entitled to witness expenses (see below)
ga: D'fhéadfá a bheith i dteideal caiteachais finné (féach thíos)

source: If your employer wants you to take the time off work as annual leave, the normal conditions for taking annual leave apply
ga: Má theastaíonn ó do fhostóir tú a chur ar an am saor ón obair mar shaoire bhliantúil, na coinníollacha gnáth as bliantúil saoire i bhfeidhm

source: Your employer must take into account your family responsibilities, opportunities for rest and recreation that are available to you and to consult with you at least one month before the leave is to be taken
ga: Ní mór don bhfostóir dualgas clainne an fhostaí a thógáil san áireamh chomh maith le deiseanna scíthe a ligean agus siamsaíochta atá ar fáil duit agus ní mór dó/do dul i gcomhairle leat mí amháin ar a laghad roimh thús na saoire

source: If you receive a "subpoena duces tecum", it will state that you must not only attend in court but you must also bring along specified documents
ga: Má fhaigheann tú "subpoena duces tecum", ní amháin go mbeidh sé ráite gur gá duit féin a bheith i láthair sa chúirt ach beidh sé ráite go gcaithfidh tú cáipéisí faoi leith a thabhairt leat

source: As a court witness, you may be entitled to witness expenses
ga: Mar fhinné cúirte beidh costais fhinné dlite duit

source: If you are a witness for the prosecution in a criminal trial, you should tell the investigating Garda who is dealing with the case what your expenses are
ga: Más finné thú ar son na gcúisitheoirí i dtriail choiriúil ba cheart duit na costais a thiteann ort a chur in iúl don Gharda atá ag plé leis an gcás

source: For example, you may miss out on wages for the days that you are in court and you may incur travel expenses to get to court
ga: Mar shampla má chailleann tú páigh do na laethanta a bhfuil tú i láthair sa chúirt nó má thiteann costais taistil ort le theacht chuig an gcúirt

source: The Garda will then make an application to the judge that witness expenses should be paid and if the judge makes an order, you will be given a cheque for your expenses
ga: Déanfaidh an Garda iarratas ansin chuig an mbreitheamh gur ceart costais fhinné a íoc agus má ordaíonn an breitheamh é tabharfar seic duit ar na costais sin

source: If you are a witness for the defence in a criminal trial, you may also be entitled to recover some of your witness expenses
ga: Más finné thú ar son na gcosantóirí i dtriail choiriúil d'fhéadfadh sé go mbeadh tú i dteideal cuid de na costais a thiteann ort a fháil ar ais

source: You should tell the solicitor who has summonsed you to come to court what your expenses are
ga: Ba cheart duit a chur in iúl don dlíodóir a sheol toghairm chugat le theacht i láthair na cúirte cé na costais a thit ort

source: If you are a witness in a civil trial, you will normally be entitled to recover any out-of-pocket expenses you have incurred as a result of having to give evidence
ga: Más finné thú i dtriail sibhialta is iondúil go mbeidh tú in ann aon chostais a thit ort de bharr na fianaise a thabhairt a éileamh ar ais

source: You should speak to the solicitor who has summonsed you to court and he or she will apply for expenses on your behalf
ga: Ba cheart duit labhairt leis an dlíodóir a sheol toghairm chugat le bheith i láthair na cúirte agus déanfaidh sé/sí iarratas ar chostais ar do shon

source: Normally all the witness expenses are paid by the party who has lost the civil case as the losing party will usually be ordered to pay the costs of both sides
ga: Go ginearálta i gcás sibhialta íocann an páirtí a chailleann an cás na costais ar fad mar is iondúil go ndéantar ordú cúirte don té a chailleann costais an dá thaobh a íoc

source: Expert witnesses such as doctors and psychiatrists are entitled to be paid a set fee for giving evidence, whether it is a criminal or a civil trial
ga: Tá finnéithe saineolaithe mar shampla dochtúirí agus síciatraithe i dteideal táille faoi leith as fianaise a thabhairt, is cuma an triail choiriúil nó sibhialta atá i gceist

source: They are also paid for the reports that they write for the purposes of the case
ga: Íoctar iad freisin as tuairiscí a scríobhann siad ar son an cháis

source: For more detailed information you should seek legal advice
ga: Ba chóir duit comhairle dlí a lorg chun faisnéis mionsonraithe a fháil
